app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-01-14 15:45:02.400539"], ["id", 1]]
---
  def update
    if current_user.update(password_params)