app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "abc@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-01-15 08:31:24.879044"], ["updated_at", "2024-01-15 08:31:24.879044"]]
---
  def create
    debugger
    @user = User.new(registration_params)
    if @user.save